## To Do #3

In [1]:
import pandas as pd
import numpy as np
pd.__version__

'0.20.1'

In [2]:
pets = pd.Series(['dog','cat','fish','hamster'], index = ['a','b','c','d'])
pets

a        dog
b        cat
c       fish
d    hamster
dtype: object

In [3]:
pets.values

array(['dog', 'cat', 'fish', 'hamster'], dtype=object)

In [4]:
pets.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
pets['a':'c']

a     dog
b     cat
c    fish
dtype: object

In [6]:
filepath = 'Top_1000_Songs_To_Hear_Before_You_Die_AndrewRyan.csv'
file = pd.read_csv(filepath)
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 994 entries, 0 to 993
Data columns (total 5 columns):
THEME          994 non-null object
TITLE          994 non-null object
ARTIST         994 non-null object
YEAR           994 non-null int64
SPOTIFY_URL    772 non-null object
dtypes: int64(1), object(4)
memory usage: 38.9+ KB

In [7]:
file.iloc[100:110:]

,THEME,TITLE,ARTIST,YEAR,SPOTIFY_URL
100,Love,Umbrella,Rihanna,2007,http://open.spotify.com/track/0dOAByk7pJESaNSc...
101,Love,You’ve Really Got a Hold On Me,Smokey Robinson and the Miracles,1962,http://open.spotify.com/track/7oLlI6vGHjjFfLkq...
102,Love,Be My Baby,The Ronettes,1963,http://open.spotify.com/track/0eXzLs2mOlkZXeft...
103,Love,Valerie,Mark Ronson featuring Amy Winehouse,2007,http://open.spotify.com/track/6wrRgHFLe5RgQLBV...
104,Love,I Saw the Light,Todd Rundgren,1972,http://open.spotify.com/track/2QNMAvCnpIN6P43f...
105,Love,Leader of the Pack,The Shangri-Las,1964,http://open.spotify.com/track/7rwBWEQ6APQBQ5sF...
106,Love,Will You Love Me Tomorrow?,The Shirelles,1961,http://open.spotify.com/track/5SqfqdRQBq3JttB5...
107,Love,Bridge Over Troubled Water,Simon and Garfunkel,1970,http://open.spotify.com/track/1eAVDtuGhk1lVVjM...
108,Love,Fly Me to the Moon,Frank Sinatra,1966,http://open.spotify.com/track/09ityNOMUHKZ1sld...
109,Love,Get Me to the Church On Time,Frank Sinatra,1966,NaN

In [8]:
foodict = {'a':1,'b':2,'c':3,'d':4}
foo = pd.Series(foodict)
color = ["red",'green','blue','yellow']
df = pd.DataFrame({'Number': foo,'Color': color})
df

    Color  Number
a     red       1
b   green       2
c    blue       3
d  yellow       4

In [9]:
songs = pd.DataFrame(file)

DataFrame: 2d

Series : 1d

In [10]:
songs.loc[1:3]

,THEME,TITLE,ARTIST,YEAR,SPOTIFY_URL
1,Love,The Shining,Badly Drawn Boy,2000,http://open.spotify.com/track/2PojSoZ94AIzp7fs...
2,Love,God Only Knows,The Beach Boys,1966,http://open.spotify.com/track/0ObrXLrfrqJUNc8R...
3,Love,Good Vibrations,The Beach Boys,1966,http://open.spotify.com/track/2oF7FZHIJbzjeEXZ...

In [11]:
songs.iloc[1:3]

,THEME,TITLE,ARTIST,YEAR,SPOTIFY_URL
1,Love,The Shining,Badly Drawn Boy,2000,http://open.spotify.com/track/2PojSoZ94AIzp7fs...
2,Love,God Only Knows,The Beach Boys,1966,http://open.spotify.com/track/0ObrXLrfrqJUNc8R...

In [12]:
test1 = pd.Series({'Mario': 85, 'Jen': 74,
                  'Alberto': 100, 'Katie': 94,
                  'Ben': 64})
test2 = pd.Series({'Mario': 97, 'Jen': 43,
                  'Alberto': 87, 'Katie': 78,
                  'Ben': 70})
scores = pd.DataFrame({'Test 1':test1, 'Test 2':test2})
scores

         Test 1  Test 2
Alberto     100      87
Ben          64      70
Jen          74      43
Katie        94      78
Mario        85      97

Adding an average column

In [13]:
scores['Average'] = (scores['Test 1'] + scores['Test 2']) / 2.0
scores

         Test 1  Test 2  Average
Alberto     100      87     93.5
Ben          64      70     67.0
Jen          74      43     58.5
Katie        94      78     86.0
Mario        85      97     91.0

In [14]:
scores.values

array([[ 100. ,   87. ,   93.5],
       [  64. ,   70. ,   67. ],
       [  74. ,   43. ,   58.5],
       [  94. ,   78. ,   86. ],
       [  85. ,   97. ,   91. ]])

Swapping rows and columns

In [15]:
scores.T

         Alberto   Ben   Jen  Katie  Mario
Test 1     100.0  64.0  74.0   94.0   85.0
Test 2      87.0  70.0  43.0   78.0   97.0
Average     93.5  67.0  58.5   86.0   91.0

In [16]:
scores[scores.Average > 90]

         Test 1  Test 2  Average
Alberto     100      87     93.5
Mario        85      97     91.0

In [17]:
rng = np.random.RandomState(42)
bingo = pd.DataFrame(rng.randint(0, 100, (5, 5)),
                  columns=['B', 'I', 'N', 'G', 'O'])
bingo

    B   I   N   G   O
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32

In [18]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  11  11
1  16   9

In [19]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  2  6  3
1  8  2  4
2  2  6  4

In [20]:
A + B

      A     B   C
0  17.0  13.0 NaN
1  18.0  17.0 NaN
2   NaN   NaN NaN

In [21]:
1+np.nan

nan

In [22]:
foo = pd.Series([7, np.nan, 'cat', None])
foo[foo.notnull()]

0      7
2    cat
dtype: object

In [23]:
foo.dropna()

0      7
2    cat
dtype: object

In [24]:
data = pd.Series([1, np.nan, 2, None, 3])
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

## To Do #4

In [25]:
filepath = "zipcodes_chris.csv"
zips = pd.read_csv(filepath)
zips.head()

     ZIP       City      County
0  15001  Aliquippa      Beaver
1  15003   Ambridge      Beaver
2  15004  Atlasburg  Washington
3  15005      Baden      Beaver
4  15006  Bairdford   Allegheny

In [26]:
zips.tail()

        ZIP     City County
2200  19609  Reading  Berks
2201  19610  Reading  Berks
2202  19611  Reading  Berks
2203  19612  Reading  Berks
2204  19640  Reading  Berks

In [27]:
count = 0
for city in zips["City"]:
    if city == "Pittsburgh":
        count += 1
print(count, "Pittsburgh zip codes")

77 Pittsburgh zip codes

In [28]:
print("Every Pittsburgh ZIP code")
pg = zips.loc[zips.City == 'Pittsburgh']
for code in pg["ZIP"]:
    print(code)

Every Pittsburgh ZIP code
15201
15202
15203
15204
15205
15206
15207
15208
15209
15210
15211
15212
15213
15214
15215
15216
15217
15218
15219
15220
15221
15222
15223
15224
15225
15226
15227
15228
15229
15230
15231
15232
15233
15234
15235
15236
15237
15238
15239
15240
15241
15242
15243
15244
15250
15251
15252
15253
15254
15255
15257
15258
15259
15260
15261
15262
15263
15264
15265
15267
15268
15270
15272
15274
15275
15276
15277
15278
15279
15281
15282
15283
15285
15286
15289
15290
15295

In [29]:
user = input("Enter ZIP code to find city: ")
loc = zips.loc[zips.ZIP == int(user)]
if loc.empty:
    print("Not a valid ZIP code")
else:
    for item in loc["City"]:
        print(item)

Enter ZIP code to find city: 15213
Pittsburgh